{
  "skills": {
    "main": [
        "Javascript",
        "React",
        "Node.JS",
        "Markup/CSS",
        "Front End Architecture",
        "FE Build & CI",
        "BDD/TDD",
        "Functional Testing"
    ],
    "misc.": [
        "Agile / Scrum",
        "Redux",
        "Webpack",
        "Gatsby",
        "Gulp / Grunt",
        "Chrome Extensions",
        "Bash Scripting",
        "User Scripting",
        "Web Scraping"
    ]
  },
  "experiences": [
    {
      "where": "Kalo",
      "when": "04.19 - 06.19",
      "blurp": [
        "Analized, standardized and improved the whole Front End, with a main focus on the common UI library.",
        "Architected and created an MVP for a Front End Monorepo.",
        "Worked on improving performances and the Dev experience."
      ]
    },
    {
      "where": "Reason",
      "when": "09.18 - 12.18",
      "blurp": [
        "Developed from scratch the whole Front End and some basic services for 3rd party client Coverly.",
        "Worked with React/Redux, Jest for testing, Storybook for documentation, and Node for API proxy.",
        "Deployed to AWS and Azure using Bitbucket pipelines.",
        "Dealt with the client and the API provider. Iterated on product and design to facilitate the development."
      ]
    },
    {
      "role": "Senior Frontend Engineer",
      "where": "Verve",
      "when": "05.17 - 07.18",
      "blurp": [
        "Worked on improving the user experience through the check-out with technologies involving React/Redux, Relay, and GraphQL.",
        "Improved the Front End unit testing environment, migrated to Jest and introduced snapshot testing.",
        "Integrated 3rd party payment methods (Stripe).",
        "Worked with the design team to improve the UI/UX."
      ]
    },
    {
      "role": "Frontend Engineer",
      "where": "Pobble Education",
      "when": "06.16 - 05.17",
      "blurp": [
        "Rewrote the whole Front End architecture following the Angular best practices, decoupling it from Rails.",
        "Introduced a Front End build system. Defined a code style guide. Introduced unit/e2e test frameworks."
      ]
    },
    {
      "role": "Senior Software Engineer",
      "where": "Shazam Entertainment",
      "when": "10.11 - 05.16",
      "blurp": [
        "Developed the main website (shazam.com).",
        "Co-operated in the realization of a modular architecture of the Front End (AMD, BEM) and its build system (Node and Gulp).",
        "Developed a custom solution for functional tests.",
        "Worked on automation tools and localisations."
      ]
    },
    {
      "role": "Web Developer (Consultant)",
      "where": "YOOX Net-a-Porter Group",
      "when": "09.10 - 10.11",
      "blurp": [
        "Mainly involved in JavaScript stuff, especially in testing TDD, unit and functional, continuous integration, and build automation.",
        "Projected and developed a targeted JS framework."
      ]
    },
    {
      "where": "Once upon a time...",
      "blurp": [
        "I had the pleasure to work also with Java, Scala, PHP, MySQL, C++, Ruby on Rails. I don't consider myself an expert on those languages but I like, especially in my free time, playing with other technologies :)"
      ]
    }
  ],
  "projects": [
    {
      "name": "Been",
      "url": "https://been.netlify.com/",
      "blurp": [
        "Web companion to keep track of where you have BEEN, listing your visited countries.",
        "React app, with auth and databased powered by Firebase. Styled using Styled-Components. And a handcrafted World Map SVG.",
        "The project is still Work in Progress :)"
      ]
    },
    {
      "name": "Should I listen it?",
      "url": "https://shouldilistenit.sirlisko.com/",
      "blurp": [
        "Little webapp that shows you the most played songs by an artist in the last two years of gigs.",
        "Node.js app that proxies external APIs (Setlist.fm, Spotify and Songkick) and mashes them up to set you up for your next Gig."
      ]
    },
    {
      "name": "Shazamify",
      "url": "https://chrome.google.com/webstore/detail/zamify/foilfgbdcipbajipeodmjjnkflkfocin",
      "blurp": [
        "Shazamify allows you to play your Shazams in Spotify, directly from the browser, by adding a small Spotify icon to every Shazam track page.",
        "Chrome Extension powered by Spotify OAuth and Web API."
      ]
    }
  ]
}
